Embedfire-emxgui/emXGUI_demo_stm32f429/99-FreeRTOS+emXGUI综合桌面/F429_挑战者开发板_V2/freeRTOS/06-emXGUI推荐应用模版/User/app/Board_App/clock/GUI_CLOCK_DIALOG.c
/*
 * @brief  重绘标题透明文本
 * @param  ds:	自定义绘制结构体
 * @retval NONE
*/
static void Title_Textbox_OwnerDraw(DRAWITEM_HDR *ds)
{
	HWND hwnd;
	HDC hdc;
  RECT rc,rc_tmp;
	WCHAR wbuf[128];

  hwnd = ds->hwnd; //button的窗口句柄.
	hdc = ds->hDC;   //button的绘图上下文句柄.
  rc = ds->rc;

  /* 背景 */
  GetClientRect(hwnd, &rc_tmp);//得到控件的位置
  WindowToScreen(hwnd, (POINT *)&rc_tmp, 1);//坐标转换
  BitBlt(hdc, rc.x, rc.y, rc.w, rc.h, hdc_bk, rc_tmp.x, rc_tmp.y, SRCCOPY);

	SetTextColor(hdc, MapRGB(hdc, 255, 255, 255));
	GetWindowText(hwnd, wbuf, 128);                        // 获得按钮控件的文字
	DrawText(hdc, wbuf, -1, &rc, DT_VCENTER|DT_CENTER);    // 绘制文字(居中对齐方式)
}

/*
 * @brief  重绘白色背景文本
 * @param  ds:	自定义绘制结构体
 * @retval NONE
*/
static void WhiteBK_Textbox_OwnerDraw(DRAWITEM_HDR *ds)
{
	HWND hwnd;
	HDC hdc;
  RECT rc,rc_tmp;
	WCHAR wbuf[128];

  hwnd = ds->hwnd; //button的窗口句柄.
	hdc = ds->hDC;   //button的绘图上下文句柄.
  rc = ds->rc;

  /* 背景 */
  SetBrushColor(hdc, MapRGB(hdc, 250, 250, 250));
  FillRect(hdc, &rc);

	SetTextColor(hdc, MapRGB(hdc, 10, 10, 10));
	GetWindowText(hwnd, wbuf, 128);                        // 获得按钮控件的文字
	DrawText(hdc, wbuf, -1, &rc, DT_VCENTER|DT_CENTER);    // 绘制文字(居中对齐方式)
}

/*
 * @brief  重绘数字透明文本
 * @param  ds:	自定义绘制结构体
 * @retval NONE
*/
static void Num_Textbox_OwnerDraw(DRAWITEM_HDR *ds)
{
  HWND hwnd;
	HDC hdc;
  RECT rc,rc_tmp;
	WCHAR wbuf[128];

  HDC hdc_temp;

  hdc_temp = CreateMemoryDC((SURF_FORMAT)COLOR_FORMAT_ARGB8888, GUI_XSIZE, GUI_YSIZE);
  ClrDisplay(hdc_temp, NULL, 0);
  BitBlt(hdc_temp, 0, 0, GUI_XSIZE, GUI_YSIZE, hdc_bk, 0, 0, SRCCOPY);
  BitBlt(hdc_temp, 497, 134, 220, 240, hdc_png[hdc_calendar], 0, 0, SRCCOPY);

	hwnd = ds->hwnd; //button的窗口句柄.
	hdc = ds->hDC;   //button的绘图上下文句柄.

	/* 背景 */
  GetClientRect(hwnd, &rc_tmp);//得到控件的位置
  GetClientRect(hwnd, &rc);//得到控件的位置
  WindowToScreen(hwnd, (POINT *)&rc_tmp, 1);//坐标转换

  BitBlt(hdc, rc.x, rc.y, rc.w, rc.h, hdc_temp, rc_tmp.x, rc_tmp.y, SRCCOPY);

  SetFont(hdc, controlFont_72);
	SetTextColor(hdc, MapRGB(hdc, 0, 0, 0));
	GetWindowText(hwnd, wbuf, 128); //获得按钮控件的文字
	DrawText(hdc, wbuf, -1, &rc, DT_VCENTER|DT_CENTER);//绘制文字(居中对齐方式)
  SetFont(hdc, defaultFont);

  DeleteDC(hdc_temp);
}

/*
 * @brief  获得列表选中项的数值（字符串转整型）
 * @param  hwnd:	窗口句柄
 * @param  ID：   列表 ID
 * @retval NONE
*/

static uint16_t GetListCurselVal(HWND hwnd, uint32_t ID)
{
  HWND wnd;
  uint8_t csl;    // 选中项
  WCHAR wbuf[10];
  char cbuf[10];

  wnd = GetDlgItem(hwnd, ID);
  csl = SendMessage(wnd, LB_GETCURSEL, 0, 0);    // 获得选中项
  SendMessage(wnd, LB_GETTEXT, csl, (LPARAM)wbuf);       // 获得选中项的文本
  x_wcstombs_cp936(cbuf, wbuf, 9);

  return x_atoi(cbuf);                           // 返回选中项的值
}

static LRESULT setting_win_proc(HWND hwnd, UINT msg, WPARAM wParam, LPARAM lParam)
{
  switch(msg){
      case WM_CREATE:
      {
        Set_Start.dial = 0;
        Set_Start.page = 0;

        for (uint8_t xC=7; xC<11; xC++)     //  按钮
        {
          /* 循环创建按钮 */
          CreateWindow(BUTTON, clock_icon[xC].icon_name, WS_OWNERDRAW | WS_VISIBLE,
                        clock_icon[xC].rc.x, clock_icon[xC].rc.y,
                        clock_icon[xC].rc.w, clock_icon[xC].rc.h,
                        hwnd, clock_icon[xC].id, NULL, NULL); 
        }

        ShowWindow(GetDlgItem(hwnd, ID_CLOCK_BACK), SW_HIDE);    // 隐藏上一步按钮

        for (uint8_t xC=11; xC<14; xC++)
        {
          /* 循环创建文本框 */
          CreateWindow(TEXTBOX, clock_icon[xC].icon_name, WS_OWNERDRAW,
                        clock_icon[xC].rc.x, clock_icon[xC].rc.y,
                        clock_icon[xC].rc.w,clock_icon[xC].rc.h,
                        hwnd, clock_icon[xC].id, NULL, NULL);
        }
        ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SETTITLE), SW_SHOW);    // 隐藏上一步按钮
         
        for (uint8_t xC=14; xC<17; xC++)
        {
          /* 循环单选按钮 */
          CreateWindow(BUTTON, clock_icon[xC].icon_name, WS_OWNERDRAW | WS_VISIBLE | BS_RADIOBOX,
                        clock_icon[xC].rc.x, clock_icon[xC].rc.y,
                        clock_icon[xC].rc.w, clock_icon[xC].rc.h,
                        hwnd, clock_icon[xC].id | (1 << 16), NULL, NULL); 
        }

        SendMessage(GetDlgItem(hwnd, ID_CLOCK_Background00), BM_SETSTATE, BST_CHECKED, 0);    // 默认选中第一个

        for (uint8_t xC=17; xC<22; xC++)
        {
          /* 创建设置列表（创建为不立即可见） */
          CreateWindow(LISTBOX, clock_icon[xC].icon_name, WS_OWNERDRAW | LBS_NOTIFY,
                            clock_icon[xC].rc.x, clock_icon[xC].rc.y, clock_icon[xC].rc.w,
                            clock_icon[xC].rc.h, hwnd, clock_icon[xC].id, NULL, NULL);
        }

        for (uint8_t xC=0; xC<24; xC++)
        {
          WCHAR wbuf[10];
          HWND ListHwnd = GetDlgItem(hwnd, ID_CLOCK_SetHour);

          /* 在列表中增加小时 */
          x_wsprintf(wbuf, L"%02d", xC);
          SendMessage(ListHwnd, LB_ADDSTRING, xC, (LPARAM)wbuf);
          SendMessage(ListHwnd, LB_SETITEMHEIGHT, xC, (LPARAM)47);
        }
        
        for (uint8_t xC=0; xC<60; xC++)
        {
          WCHAR wbuf[10];
          HWND ListHwnd = GetDlgItem(hwnd, ID_CLOCK_SetMinute);

          /* 在列表中增加小时 */
          x_wsprintf(wbuf, L"%02d", xC);
          SendMessage(ListHwnd, LB_ADDSTRING, xC, (LPARAM)wbuf);
          SendMessage(ListHwnd, LB_SETITEMHEIGHT, xC, (LPARAM)47);
        }

        int i=0;
        for (uint16_t xC=2000; xC<2099; xC++)
        {
          WCHAR wbuf[10];
          
          HWND ListHwnd = GetDlgItem(hwnd, ID_CLOCK_SetYear);

          /* 在列表中增加年 */
          x_wsprintf(wbuf, L"%d", xC);
          SendMessage(ListHwnd, LB_ADDSTRING, -1, (LPARAM)wbuf);
          SendMessage(ListHwnd, LB_SETITEMHEIGHT, i++, (LPARAM)47);
        }

        i=0;
        for (uint8_t xC=1; xC<13; xC++)
        {
          WCHAR wbuf[10];
          HWND ListHwnd = GetDlgItem(hwnd, ID_CLOCK_SetMonth);

          /* 在列表中增加月 */
          x_wsprintf(wbuf, L"%d", xC);
          SendMessage(ListHwnd, LB_ADDSTRING, -1, (LPARAM)wbuf);
          SendMessage(ListHwnd, LB_SETITEMHEIGHT, i++, (LPARAM)47);
        }

        i=0;
        for (uint8_t xC=1; xC<32; xC++)
        {
          WCHAR wbuf[10];
          HWND ListHwnd = GetDlgItem(hwnd, ID_CLOCK_SetDate);

          /* 在列表中增加日期 */
          x_wsprintf(wbuf, L"%d", xC);
          SendMessage(ListHwnd, LB_ADDSTRING, -1, (LPARAM)wbuf);
          SendMessage(ListHwnd, LB_SETITEMHEIGHT, i++, (LPARAM)47);
        }

