Embedfire-emxgui/emXGUI_demo_stm32f429/99-FreeRTOS+emXGUI综合桌面/F429_挑战者开发板_V2/freeRTOS/06-emXGUI推荐应用模版/User/app/Board_App/clock/GUI_CLOCK_DIALOG.c
        SetTimer(hwnd, 1, 50, TMR_START, NULL);
        
        break;
      }

      case WM_TIMER:
      {
        int cur_sel, i, y;
        HWND wnd;
        RECT rc0, rc;

        if(GetKeyState(VK_LBUTTON)==0) //鼠标左键／触摸屏　没有按下时.
        {
          for (uint32_t xC=ID_CLOCK_SetYear; xC<ID_CLOCK_SetMinute+1; xC++)
          {
            wnd =GetDlgItem(hwnd, xC); //获得LISTBOX 设置时的HWND.

            cur_sel=SendMessage(wnd,LB_GETCURSEL,0,0); //获得LISTBOX顶项.

            GetClientRect(wnd,&rc0);
            SendMessage(wnd,LB_GETITEMRECT,cur_sel,(LPARAM)&rc); //获得顶项的矩形位置.

            y = rc.y+(rc.h/2);

            if(y < (rc0.h/2)) //如果选中的项在Listbox　中线的上面,则往下移动.
            {
              if(abs(y-(rc0.h/2)) > (rc.h>>2))
              {//与中线隔得远，就每次多移一点距离(看上去移动速度快)．
                //i =rc.h>>2;
                i = 4;
              }
              else
              {//与中线隔得很近了，就只移1个offset(缓慢移动)．
                i = 1;
              }

              SendMessage(wnd,LB_OFFSETPOS,TRUE,i);
            }

            if(y > (rc0.h/2)) //如果选中的项在Listbox　中线的下面,则往上移动.
            {
              if(abs(y-(rc0.h/2)) > (rc.h>>2))
              {//与中线隔得远，就每次多移一点距离(看上去移动速度快)．
                //i =rc.h>>2;
                i = 4;
              }
              else
              {//与中线隔得很近了，就只移1个offset(缓慢移动)．
                i = 1;
              }

              SendMessage(wnd,LB_OFFSETPOS,TRUE,-i);
            }
          }
        }
        
      }  
			break;     
      
      case WM_NOTIFY:
      {
         u16 code, id;
         id  =LOWORD(wParam);//获取消息的ID码
         code=HIWORD(wParam);//获取消息的类型
         
         NMHDR *nr;
         nr =(NMHDR*)lParam;      

         //发送单击
        if(code == BN_CLICKED)
        {
          switch (id)
          {
            /* 退出按钮按下 */
            case ID_CLOCK_WAIVE:
            {
              PostCloseMessage(hwnd);    // 发送关闭窗口的消息
            }
            break;

            /* 完成设置按钮按下 */
            case ID_CLOCK_OK:
            {
              if (Set_Start.page == 0)    // 只设置表盘
              {
                clock_dial = Set_Start.dial;    // 设置表盘
              }
              else if (Set_Start.page == 1)    // 修改表盘和时间
              {
                RTC_TimeTypeDef RTC_Time;

                clock_dial = Set_Start.dial;    // 设置表盘
                RTC_Time.RTC_Hours = GetListCurselVal(hwnd, ID_CLOCK_SetHour);        // 读取列表的时
                RTC_Time.RTC_Minutes = GetListCurselVal(hwnd, ID_CLOCK_SetMinute);    // 读取列表的分
                RTC_Time.RTC_Seconds = 0;

                RTC_SetTime(RTC_Format_BIN, &RTC_Time);    // 设置时间
              }
              else if (Set_Start.page == 2)    // 修改表盘、时间和日历
              {
                RTC_DateTypeDef RTC_Date;
                RTC_TimeTypeDef RTC_Time;

                clock_dial = Set_Start.dial;    // 设置表盘

                RTC_Time.RTC_Hours = GetListCurselVal(hwnd, ID_CLOCK_SetHour);        // 读取列表的时
                RTC_Time.RTC_Minutes = GetListCurselVal(hwnd, ID_CLOCK_SetMinute);    // 读取列表的分
                RTC_Time.RTC_Seconds = 0;
                RTC_SetTime(RTC_Format_BIN, &RTC_Time);    // 设置时间

                RTC_Date.RTC_Year = GetListCurselVal(hwnd, ID_CLOCK_SetYear) - 2000;    // 读取列表的年
                RTC_Date.RTC_Month = GetListCurselVal(hwnd, ID_CLOCK_SetMonth);         // 读取列表的月
                RTC_Date.RTC_Date = GetListCurselVal(hwnd, ID_CLOCK_SetDate);           // 读取列表的日
                /* 基姆拉尔森周计算公式 */
                RTC_Date.RTC_WeekDay = (RTC_Date.RTC_Date + 2 * RTC_Date.RTC_Month + 3     \
                                        * (RTC_Date.RTC_Month + 1) / 5 + RTC_Date.RTC_Year \
                                        + RTC_Date.RTC_Year / 4 - RTC_Date.RTC_Year / 100  \
                                        + RTC_Date.RTC_Year / 400) % 7 + 1;
                RTC_SetDate(RTC_Format_BIN, &RTC_Date);                                 // 设置日期

                /* 设置当前显示日期 */
                WCHAR wbuf[5];
                char  cbuf[5];
                
                x_wsprintf(wbuf, L"%d", RTC_Date.RTC_Date);
                SetWindowText(GetDlgItem(hwnd, ID_CLOCK_DAY), wbuf);    // 设置日期
                
                x_wsprintf(wbuf, L"%d月", RTC_Date.RTC_Month);
                SetWindowText(GetDlgItem(hwnd, ID_CLOCK_MONTH), wbuf);    // 设置月
                
                SetWindowText(GetDlgItem(hwnd, ID_CLOCK_WEEK), Week_List[RTC_Date.RTC_WeekDay - 1]);    // 设置星期
              }

              PostCloseMessage(hwnd);    // 发送关闭窗口的消息
            }
            break;

            /* 表盘选择 */
            case ID_CLOCK_Background00:
            {
              Set_Start.dial = 0;    // 选择表盘 1
            }
            break;

            /* 表盘选择 */
            case ID_CLOCK_Background01:
            {
              Set_Start.dial = 1;    // 选择表盘 2
            }
            break;

            /* 表盘选择 */
            case ID_CLOCK_Background02:
            {
              Set_Start.dial = 2;    // 选择表盘 3
            }
            break;

            /* 下一步 */
            case ID_CLOCK_NEXT:
            {
              if (Set_Start.page == 0)
              {
                Set_Start.page = 1;    // 标记为时钟设置界面
                SetWindowText(GetDlgItem(hwnd, ID_CLOCK_SETTITLE), L"设置时间");

                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_Background00), SW_HIDE);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_Background01), SW_HIDE);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_Background02), SW_HIDE);

                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SetHour),      SW_SHOW);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SetMinute),    SW_SHOW);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_BACK),         SW_SHOW);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SETTIME),      SW_SHOW);
              }
              else if (Set_Start.page == 1)
              {
                Set_Start.page = 2;    // 标记为日期设置界面
                SetWindowText(GetDlgItem(hwnd, ID_CLOCK_SETTITLE), L"设置日期");

                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SetHour),   SW_HIDE);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SetMinute), SW_HIDE);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_NEXT),      SW_HIDE);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SETTIME),   SW_HIDE);

