Embedfire-emxgui/emXGUI_demo_stm32f429/99-FreeRTOS+emXGUI综合桌面/F429_挑战者开发板_V2/freeRTOS/06-emXGUI推荐应用模版/User/app/Board_App/clock/GUI_CLOCK_DIALOG.c
        }

      break;
    }

      // 重绘制函数消息
      case WM_DRAWITEM:
      {
        DRAWITEM_HDR *ds;
        ds = (DRAWITEM_HDR*)lParam;        
        if (ds->ID >= ID_CLOCK_BACK && ds->ID <= ID_CLOCK_OK)
        {
          btn_owner_draw(ds);             // 重绘按钮
          return TRUE;
        }
        else if (ds->ID == ID_CLOCK_SETTITLE)
        {
          Title_Textbox_OwnerDraw(ds);
          return TRUE;
        }
        else if (ds->ID == ID_CLOCK_SETTIME || ds->ID == ID_CLOCK_SETDATE)
        {
          WhiteBK_Textbox_OwnerDraw(ds);
          return TRUE;
        }
        else if (ds->ID == ID_CLOCK_WAIVE)
        {
          waive_btn_owner_draw(ds);
          return TRUE;
        }
        else if (ds->ID >= ID_CLOCK_Background00 && ds->ID <= ID_CLOCK_Background02)
        {
          radiobox_owner_draw(ds, ds->ID);
          return TRUE;
        }
        else if (ds->ID >= ID_CLOCK_SetYear && ds->ID <= ID_CLOCK_SetMinute)
        {
          listbox_owner_draw(ds);
          return TRUE;
        }

        return FALSE;
      }     
      
      //绘制窗口界面消息
      case WM_PAINT:
      {
        PAINTSTRUCT ps;
        HDC hdc;//屏幕hdc

        //开始绘制
        hdc = BeginPaint(hwnd, &ps); 
        
        EndPaint(hwnd, &ps);
      }
      break;

      case WM_ERASEBKGND:
      {
        HDC hdc =(HDC)wParam;
        RECT rc =*(RECT*)lParam;
        RECT rc1 = {230, 98, 339, 280};

        BitBlt(hdc, rc.x, rc.y, rc.w, rc.h, hdc_bk, rc.x, rc.y, SRCCOPY);

        if (Set_Start.page != 0)     // 不是表盘选择
        {
          SetBrushColor(hdc, MapRGB(hdc, 250, 250, 250));
          EnableAntiAlias(hdc, TRUE);
          FillRoundRect(hdc, &rc1, 10);    // 画列表背景
          EnableAntiAlias(hdc, FALSE);
        }

        return TRUE;
      }

      //关闭窗口消息处理case
      case WM_CLOSE:
      {   
        DestroyWindow(hwnd);
        return TRUE;	
      }
    
      //关闭窗口消息处理case
      case WM_DESTROY:
      {
        SetTimer(clock_hwnd, 1, 1000, TMR_START, NULL);

        return PostQuitMessage(hwnd);		
      }
      
      default:
         return DefWindowProc(hwnd, msg, wParam, lParam);
   }
     
   return WM_NULL;
}

static LRESULT win_proc(HWND hwnd, UINT msg, WPARAM wParam, LPARAM lParam)
{ 
   switch(msg){
      case WM_CREATE:
      {
         u8 *jpeg_buf;
         u32 jpeg_size;
         JPG_DEC *dec;
         BOOL res = NULL;

         //res = RES_Load_Content(GUI_CLOCK_BACKGROUNG_PIC, (char**)&jpeg_buf, &jpeg_size);
        res = FS_Load_Content(GUI_CLOCK_BACKGROUNG_PIC, (char**)&jpeg_buf, &jpeg_size);
        hdc_bk = CreateMemoryDC(SURF_SCREEN, GUI_XSIZE, GUI_YSIZE);
        if(res)
        {
          /* 根据图片数据创建JPG_DEC句柄 */
          dec = JPG_Open(jpeg_buf, jpeg_size);

          /* 绘制至内存对象 */
          JPG_Draw(hdc_bk, 0, 0, dec);

          /* 关闭JPG_DEC句柄 */
          JPG_Close(dec);
        }
        /* 释放图片内容空间 */
        RES_Release_Content((char **)&jpeg_buf); 

//         exit_sem = GUI_SemCreate(0,1);//创建一个信号量        

        for (uint8_t xC=0; xC<ICON_BTN_NUM; xC++)     //  按钮
        {
          /* 循环创建按钮 */
          CreateWindow(BUTTON, clock_icon[xC].icon_name, WS_OWNERDRAW | WS_VISIBLE,
                        clock_icon[xC].rc.x, clock_icon[xC].rc.y,
                        clock_icon[xC].rc.w, clock_icon[xC].rc.h,
                        hwnd, clock_icon[xC].id, NULL, NULL); 
        }

        for (uint8_t xC=ICON_BTN_NUM; xC<ICON_TEXT_NUM; xC++)    // 文本框
        {
          /* 循环创建文本框 */
          CreateWindow(TEXTBOX, clock_icon[xC].icon_name, WS_OWNERDRAW | WS_VISIBLE,
                        clock_icon[xC].rc.x, clock_icon[xC].rc.y,
                        clock_icon[xC].rc.w,clock_icon[xC].rc.h,
                        hwnd, clock_icon[xC].id, NULL, NULL); 
        }

        /* 初始化日期 */
        WCHAR wbuf[5];
        char cbuf[5];
        RTC_TIME rtc_time;
        RTC_GetDate(RTC_Format_BIN, &rtc_time.RTC_Date);
        
        x_wsprintf(wbuf, L"%d", rtc_time.RTC_Date.RTC_Date);
        SetWindowText(GetDlgItem(hwnd, ID_CLOCK_DAY), wbuf);    // 设置日期
        
        x_wsprintf(wbuf, L"%d月", rtc_time.RTC_Date.RTC_Month);
        SetWindowText(GetDlgItem(hwnd, ID_CLOCK_MONTH), wbuf);    // 设置月
        
        SetWindowText(GetDlgItem(hwnd, ID_CLOCK_WEEK), Week_List[rtc_time.RTC_Date.RTC_WeekDay - 1]);    // 设置星期

        u8 *pic_buf;
        u32 pic_size;
        PNG_DEC *png_dec;
        BITMAP png_bm;
        
        for (uint8_t xC=0; xC<hdc_end; xC++)
        {
          /* 创建 HDC */
          hdc_png[clock_png_info[xC].id] = CreateMemoryDC((SURF_FORMAT)COLOR_FORMAT_ARGB8888, clock_png_info[xC].w, clock_png_info[xC].h);
          ClrDisplay(hdc_png[clock_png_info[xC].id], NULL, 0);
          // res = RES_Load_Content(clock_png_info.pic_name, (char**)&pic_buf, &pic_size);
          res = FS_Load_Content(clock_png_info[xC].pic_name, (char**)&pic_buf, &pic_size);
          if(res)
          {
            png_dec = PNG_Open(pic_buf, pic_size);
            PNG_GetBitmap(png_dec, &png_bm);
            DrawBitmap(hdc_png[clock_png_info[xC].id], 0, 0, &png_bm, NULL);
            PNG_Close(png_dec);
          }
          /* 释放图片内容空间 */
          RES_Release_Content((char **)&pic_buf);
        }

        /* 转换成bitmap */
        DCtoBitmap(hdc_png[hdc_clock_s_00], &bm_clock_s_00);
        DCtoBitmap(hdc_png[hdc_clock_h_00], &bm_clock_h_00);
        DCtoBitmap(hdc_png[hdc_clock_m_00], &bm_clock_m_00);
        DCtoBitmap(hdc_png[hdc_clock_s_01], &bm_clock_s_01);
        DCtoBitmap(hdc_png[hdc_clock_h_01], &bm_clock_h_01);
        DCtoBitmap(hdc_png[hdc_clock_m_01], &bm_clock_m_01);
        DCtoBitmap(hdc_png[hdc_clock_s_02], &bm_clock_s_02);
        DCtoBitmap(hdc_png[hdc_clock_h_02], &bm_clock_h_02);
        DCtoBitmap(hdc_png[hdc_clock_m_02], &bm_clock_m_02);

        SetTimer(hwnd, 1, 1000, TMR_START, NULL);

        break;
      }

      case WM_TIMER:
      {
        int tmr_id;
				WCHAR wbuf[10];
        int xx = 0;
        int yy = 0;

				tmr_id = wParam;    // 定时器 ID


				if (tmr_id == 1)
        {
          WCHAR wbuf[5];
          char cbuf[5];
          RTC_TIME rtc_time;
          RTC_GetDate(RTC_Format_BIN, &rtc_time.RTC_Date);
          
